# Базовый образ
FROM node:12-stretch

# Создать рабочую директорию
RUN mkdir -p /app/

# Устанавливаем созданный каталог в качестве рабочего
WORKDIR /app/

# Копируем нужные файлы окружения в рабочий каталог
COPY package*.json ./

# Загрузка зависимостей из .json файлов
RUN npm install

# Загружаем в рабочий каталог все необходимые файлы кроме тех,
# что указаны в .dokerignore
COPY . /app

# Порт для прослушки контейнера
EXPOSE 3003

# Команда для выполнения контейнера
CMD [ "node", "index.js" ]